[
  {
    "id": "70cb7706-16d0-43d1-82c2-d679e50ab46c",
    "name": "Carl L.",
    "linkedin_url": "https://www.linkedin.com/in/carlmlindner",
    "picture_url": null,
    "bio": "I am a property tax consultant with a decade of valuation experience.",
    "role": "Property Tax Consultant",
    "companies": [
      "Assessment Counselling Services",
      "Los Angeles County Office of the Assessor",
      "CAPE Union",
      "GT Events",
      "eBacchus.com",
      "THE MONTECITO PICTURE COMPANY",
      "REEL LOUD FILM FESTIVAL 2009",
      "UC Santa Barbara Parking Services",
      "UC SANTA BARBARA REC SPORTS",
      "Carl M. Lindner"
    ],
    "current_location": "Westlake Village, CA",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:32:31.908579",
    "experiences": [
      {
        "position": "Property Tax Consultant",
        "company": "Assessment Counselling Services",
        "location": "Westlake Village, CA",
        "duration": "Feb 2020 to Present",
        "description": "Helping clients determine the fair market value of their properties in order to make sure they are not paying more than their fair share of property taxes. Offering practical solutions to valuation problems.\nSpecializing in Ownership Change Review, Real Property Appraisal, Aircraft Appraisal and Personal Property Compliance Filing and Audit.\nHelping clients determine the fair market value of their properties in order to make sure they are not paying more than their fair share of property taxes. Offering practical solutions to valuation problems. Specializing in Ownership Change Review, Real Property Appraisal, Aircraft Appraisal and Personal Property Compliance Filing and Audit.\nSkills: Compliance Property Tax · Problem Solving · Written Communication · Tax Assessment · Property Tax · Navigation · Property Tax Planning · Digital Marketing\nCompliance Property Tax · Problem Solving · Written Communication · Tax Assessment · Property Tax · Navigation · Property Tax Planning · Digital Marketing"
      },
      {
        "position": "",
        "company": "Los Angeles County Office of the Assessor",
        "location": "",
        "duration": " - Present",
        "description": "Appraiser Specialist\nMar 2016 - Jan 2020 · 3 yrs 11 mos\nGreater Los Angeles Area\nState Board of Equalization certified Real Property Appraiser specializing in the valuation of complex properties, primarily Oil Refineries. Responsible for the creation of multi-year Assessment Appeals Cases, developing a standard method for valuing Intangible Assets as part of a property's total Business Enterprise Value (BEV), and producing a complete ad valorem appraisal for certain refineries in LA County as of the first of the year, every year.\nSkills: Problem Solving · Written Communication · Tax Assessment · Property Tax · Navigation\nProblem Solving · Written Communication · Tax Assessment · Property Tax · Navigation\nAppraiser\nOct 2013 - Mar 2016 · 2 yrs 6 mos\nSBE certified appraiser of real property. I have experience appraising luxury residences, and now I work in the Natural Resources section appraising Oil Refineries.\nSkills: Written Communication\nWritten Communication\nAppraiser Trainee\nOct 2012 - Oct 2013 · 1 yr 1 mo"
      },
      {
        "position": "Director",
        "company": "CAPE Union",
        "location": "Los Angeles County",
        "duration": "Sep 2015 to May 2018",
        "description": "Elected to help guide and manage the activities of the CAPE Union on behalf of all members.\nSkills: Problem Solving\nProblem Solving"
      },
      {
        "position": "ACCOUNT EXECUTIVE/SOCIAL MEDIA MANAGER",
        "company": "GT Events",
        "location": "Greater Los Angeles Area",
        "duration": "Mar 2010 to Oct 2012",
        "description": "· Creating and posting staffing profiles, hiring and supervising event staff nationwide\n· Handling and completing purchase orders, creating full event budgets\n· Communicating with client to determine and fulfill event preparation, logistics and\nexecution\n· Creating and posting staffing profiles, hiring and supervising event staff nationwide · Handling and completing purchase orders, creating full event budgets · Communicating with client to determine and fulfill event preparation, logistics and execution\nSkills: Written Communication · Navigation\nWritten Communication · Navigation"
      },
      {
        "position": "DIRECTOR OF OPERATIONS",
        "company": "eBacchus.com",
        "location": "Greater Los Angeles Area",
        "duration": "Mar 2010 to Aug 2011",
        "description": "· Creating advertising and marketing plans to maximize website exposure within the\nonline wine community, developing viral marketing strategies\n· Monitoring the development of a new beta site and supplying CEO with status reports\n· Performing technical support duties for website executives\n· Creating advertising and marketing plans to maximize website exposure within the online wine community, developing viral marketing strategies · Monitoring the development of a new beta site and supplying CEO with status reports · Performing technical support duties for website executives"
      },
      {
        "position": "OFFICE INTERN",
        "company": "THE MONTECITO PICTURE COMPANY",
        "location": "Santa Barbara, California Area",
        "duration": "Sep 2009 to Dec 2009",
        "description": "Performed clerical duties such as filing, delivering mail, sorting, copying scripts, writing coverage. Organized archives, generated script coverage, and acted as a courier"
      },
      {
        "position": "HEAD PRODUCER",
        "company": "REEL LOUD FILM FESTIVAL 2009",
        "location": "Santa Barbara, California Area",
        "duration": "Nov 2008 to Nov 2009",
        "description": "Created a comprehensive budget and managed finances for the festival, collaborated with UCSB campus organizations to gain funding, developed marketing plans to promote festival\nin Santa Barbara area, facilitated communication between technical crew and venue crew to ensure a flawless show, secured necessary permits from the University to put on festival,\ncontacted vendors and secured equipment for festival, picked films, musical acts and live acts and scheduled event from start to finish, hired capable staff members to implement strategies and perform duties\nCreated a comprehensive budget and managed finances for the festival, collaborated with UCSB campus organizations to gain funding, developed marketing plans to promote festival in Santa Barbara area, facilitated communication between technical crew and venue crew to ensure a flawless show, secured necessary permits from the University to put on festival, contacted vendors and secured equipment for festival, picked films, musical acts and live acts and scheduled event from start to finish, hired capable staff members to implement strategies and perform duties"
      },
      {
        "position": "EVENTS SUPERVISOR",
        "company": "UC Santa Barbara Parking Services",
        "location": "",
        "duration": "Oct 2006 to Jun 2008",
        "description": "· Managed a team of 15 student workers during on-campus events\n· Hired responsible students, developed work schedules, and reviewed performance\n· Resolved customer issues, and taught staff customer service skills\n· Accurately accounted for monies collected for parking permits and violations\n· Managed a team of 15 student workers during on-campus events · Hired responsible students, developed work schedules, and reviewed performance · Resolved customer issues, and taught staff customer service skills · Accurately accounted for monies collected for parking permits and violations"
      },
      {
        "position": "SALES REPRESENTATIVE",
        "company": "UC SANTA BARBARA REC SPORTS",
        "location": "Santa Barbara, California Area",
        "duration": "Mar 2007 to Jun 2007",
        "description": "2007\nCreated and implemented specific marketing plans to maximize business exposure on campus and in Santa Barbara area, collaborated with sales team to develop effective methods\nfor brand awareness, performed sales-based tasks such as face-to-face sales pitches and cold-calling\n2007 Created and implemented specific marketing plans to maximize business exposure on campus and in Santa Barbara area, collaborated with sales team to develop effective methods for brand awareness, performed sales-based tasks such as face-to-face sales pitches and cold-calling"
      },
      {
        "position": "Professional Actor",
        "company": "Carl M. Lindner",
        "location": "Greater New York City Area",
        "duration": "May 1992 to Jul 2002",
        "description": "I was a child actor for ten years, taking on both serious and comedic roles in movies, television, and national commercials.\nSome of my experience can be seen on IMDB.\nhttp://www.imdb.com/name/nm0512015/\nI was a child actor for ten years, taking on both serious and comedic roles in movies, television, and national commercials. Some of my experience can be seen on IMDB. http://www.imdb.com/name/nm0512015/\nCarl Michael Lindner\nCarl Michael Lindner, Actor: Krippendorf's Tribe. Carl Michael Lindner was born in 1988 in New York, USA. He is an actor, known for Krippendorf's Tribe (1998), Slappy and the Stinkers (1998) and Something Wilder (1994)."
      }
    ]
  },
  {
    "id": "52f4c6da-eb77-4068-9de3-f2f3f5eb75f5",
    "name": "Carlos Montes",
    "linkedin_url": "https://www.linkedin.com/in/carlos-montes-hr",
    "picture_url": null,
    "bio": "Human Resources Professional with experience in fast-growing startups. Provide a unique perspective including the understanding human capital is every organization’s greatest asset. I pride myself in being a high producer while continually improving effectiveness and efficiency by leveraging technology.",
    "role": "People Operations Manager",
    "companies": [
      "Heath Ceramics",
      "Veev",
      "AiFi Inc.",
      "AutoVitals",
      "BioIQ"
    ],
    "current_location": "San Francisco Bay Area",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:33:14.989729",
    "experiences": [
      {
        "position": "People Operations Manager",
        "company": "Heath Ceramics",
        "location": "San Francisco Bay Area",
        "duration": "May 2023 to Present",
        "description": "Skills: Bilingual Communications\nBilingual Communications"
      },
      {
        "position": "HR Operations Manager",
        "company": "Veev",
        "location": "San Francisco Bay Area",
        "duration": "Sep 2020 to May 2023",
        "description": "Skills: HR Operations · Human Resources Information Systems (HRIS) · Employee Relations · Project Management · Compensation & Benefits · Bilingual Communications\nHR Operations · Human Resources Information Systems (HRIS) · Employee Relations · Project Management · Compensation & Benefits · Bilingual Communications"
      },
      {
        "position": "Senior Talent People Operations",
        "company": "AiFi Inc.",
        "location": "San Francisco Bay Area · On-site",
        "duration": "Sep 2019 to Mar 2020",
        "description": "Cooperated with company leaders in change management and talent solutions to gain competitive edge in job market.\nImplemented and managed new HR systems including HRIS, 401(k) Plan Administrator, Benefits Enrollment System, Applicant Tracking System (ATS), Student Loan Repayment, Compensation Data Software, and Equity Management Software, etc.\nEstablished consistent language and methodology for talent discussions, development, and succession.\nDesigned and managed new full life cycle of recruiting for our US and Europe offices growing headcount by 20% through new sourcing hacks and ways how to attract new potential candidates.\nCollaborated with hiring managers on global workforce forecasting and hiring strategies.\nFostered positive employee engagement that empowered and praised employees take responsibility for their successes and failures; leading to workplace of diversity and inclusion.\nCooperated with company leaders in change management and talent solutions to gain competitive edge in job market. Implemented and managed new HR systems including HRIS, 401(k) Plan Administrator, Benefits Enrollment System, Applicant Tracking System (ATS), Student Loan Repayment, Compensation Data Software, and Equity Management Software, etc. Established consistent language and methodology for talent discussions, development, and succession. Designed and managed new full life cycle of recruiting for our US and Europe offices growing headcount by 20% through new sourcing hacks and ways how to attract new potential candidates. Collaborated with hiring managers on global workforce forecasting and hiring strategies. Fostered positive employee engagement that empowered and praised employees take responsibility for their successes and failures; leading to workplace of diversity and inclusion.\nSkills: Bilingual Communications\nBilingual Communications"
      },
      {
        "position": "HR Consultant",
        "company": "AutoVitals",
        "location": "Santa Barbara, California Area · On-site",
        "duration": "Mar 2019 to Sep 2019",
        "description": "Advised executives on best practices for HR initiatives in areas of recruiting, hiring, talent management, employee relations, onboarding, and off-boarding.\nProvided manager training for best HR practices and procedures regarding hiring and employee relations.\nAssisted and guided on HR procedures and program development by devising performance evaluations, job descriptions and industry-standard salary ranges.\nInvestigated employee complaints, kept documentation and reviewed action plan with HR.\nAdvised executives on best practices for HR initiatives in areas of recruiting, hiring, talent management, employee relations, onboarding, and off-boarding. Provided manager training for best HR practices and procedures regarding hiring and employee relations. Assisted and guided on HR procedures and program development by devising performance evaluations, job descriptions and industry-standard salary ranges. Investigated employee complaints, kept documentation and reviewed action plan with HR.\nSkills: Bilingual Communications\nBilingual Communications"
      },
      {
        "position": "",
        "company": "BioIQ",
        "location": "On-site",
        "duration": "Full-time - Present",
        "description": "Head of People\nDec 2014 - Mar 2019 · 4 yrs 4 mos\nSanta Barbara, CA\nServed as HR Department of one directly reporting to Chief Operating Officer.\nCaptured $45k in benefit cost reductions and lowered employee benefits cost by 9.1% in 2018 through plan redesign, education, and contract negotiations.\nDeveloped and implemented personnel policies and procedures in areas of HR, Compliance, Security, and Privacy.\nImplemented and managed company's first Human Resources Information System (HRIS) improving business processes while providing stakeholders improved HR and payroll reporting.\nImplemented company's first performance review process.\nDeveloped and implemented company wellness initiatives including biometric screenings and flu shot programs for employees and their families.\nManaged immigration cases to improve immigration strategy for higher employee retention.\nDesigned and managed all HR functions to align with strategic direction of organization including recruitment, training, on-boarding, employee relations, immigration, payroll, performance, benefits, and off-boarding.\nCreated and implemented hiring policies, procedures, systems, and technologies to support company's long-term growth including expansion into new Atlanta, GA office.\nManaged benefits brokers and administered benefits including 401(k) plan, becoming subject matter expert for all benefits related questions.\nCreated and implemented employee handbook with continuous updates in accordance with new federal, state, local, and other regulations.\nImplemented employee engagement tool to measure and improve company culture, empowering employees to have voice in growth of company.\nServed as HR Department of one directly reporting to Chief Operating Officer. Captured $45k in benefit cost reductions and lowered employee benefits cost by 9.1% in 2018 through plan redesign, education, and contract negotiations. Developed and implemented personnel policies and procedures in areas of HR, Compliance, Security, and Privacy. Implemented and managed company's first Human Resources Information System (HRIS) improving business processes while providing stakeholders improved HR and payroll reporting. Implemented company's first performance review process. Developed and implemented company wellness initiatives including biometric screenings and flu shot programs for employees and their families. Managed immigration cases to improve immigration strategy for higher employee retention. Designed and managed all HR functions to align with strategic direction of organization including recruitment, training, on-boarding, employee relations, immigration, payroll, performance, benefits, and off-boarding. Created and implemented hiring policies, procedures, systems, and technologies to support company's long-term growth including expansion into new Atlanta, GA office. Managed benefits brokers and administered benefits including 401(k) plan, becoming subject matter expert for all benefits related questions. Created and implemented employee handbook with continuous updates in accordance with new federal, state, local, and other regulations. Implemented employee engagement tool to measure and improve company culture, empowering employees to have voice in growth of company.\nSkills: Bilingual Communications\nBilingual Communications\nOperations Manager\nSep 2011 - Nov 2014 · 3 yrs 3 mos\nSanta Barbara, California Area\nManaged Operations Team of 10-15 employees while maintaining service level agreement for lab tests fulfillment and date processing.\nOversaw design, production, licensing, and quality control of lab test kits while maintaining FDA regulatory controls to ensure safety and effectiveness of medical devices.\nResponsible for manufacturing, logistics, inventory, fulfillment, and shipping of lab test kits and test kit supplies.\nProvided technical support with strong troubleshooting skills, rapidly identifying and resolving hardware, software, and network issues.\nReduced cost of office supplies and furniture, office equipment, etc., resulting in 32% overall annual savings.\nManaged Operations Team of 10-15 employees while maintaining service level agreement for lab tests fulfillment and date processing. Oversaw design, production, licensing, and quality control of lab test kits while maintaining FDA regulatory controls to ensure safety and effectiveness of medical devices. Responsible for manufacturing, logistics, inventory, fulfillment, and shipping of lab test kits and test kit supplies. Provided technical support with strong troubleshooting skills, rapidly identifying and resolving hardware, software, and network issues. Reduced cost of office supplies and furniture, office equipment, etc., resulting in 32% overall annual savings."
      }
    ]
  },
  {
    "id": "a1f0ea77-4349-4039-ada1-1059f6e101a7",
    "name": "Jolene T.",
    "linkedin_url": "https://www.linkedin.com/in/jolene-t-b3b78820",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [
      "United States Attorneys' Offices",
      "United States Bankruptcy Court",
      "Children's Law Center of Los Angeles",
      "United States Bankruptcy Court"
    ],
    "current_location": "Los Angeles",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:33:58.016872",
    "experiences": [
      {
        "position": "",
        "company": "United States Attorneys' Offices",
        "location": "",
        "duration": " - Present",
        "description": "Assistant United States Attorney\nJul 2024 - Present · 1 yr\nChief\nMay 2024 - Jul 2024 · 3 mos\nDeputy Chief\nJun 2015 - May 2024 · 9 yrs"
      },
      {
        "position": "",
        "company": "United States Bankruptcy Court",
        "location": "",
        "duration": " - Present",
        "description": "Judicial Law Clerk\nDec 2014 - Mar 2015 · 4 mos\nLos Angeles, CA\nMar 2013 - Nov 2014 · 1 yr 9 mos\nRiverside, California"
      },
      {
        "position": "Summer Law Clerk",
        "company": "Children's Law Center of Los Angeles",
        "location": "Los Angeles",
        "duration": "Jun 2010 to Jan 2011",
        "description": null
      },
      {
        "position": "Judicial Extern",
        "company": "United States Bankruptcy Court",
        "location": "Los Angeles",
        "duration": "2011 - - Present",
        "description": null
      }
    ]
  },
  {
    "id": "71a5aa7b-3695-47ee-ad16-e7032b28a97d",
    "name": "Laura Lin, CPA",
    "linkedin_url": "https://www.linkedin.com/in/laura-lin-cpa-9429b619",
    "picture_url": null,
    "bio": null,
    "role": "Controller",
    "companies": [
      "Sequoia Climate Foundation",
      "SouthWest Dealer Services",
      "ASICS America Corporation",
      "Viant Inc.",
      "International Education Corporation",
      "BDO LLP",
      "Toastmasters International",
      "BDO USA, LLP"
    ],
    "current_location": "Irvine, California",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:34:41.714217",
    "experiences": [
      {
        "position": "Controller",
        "company": "Sequoia Climate Foundation",
        "location": "",
        "duration": "Mar 2022 to Present",
        "description": null
      },
      {
        "position": "Controller",
        "company": "SouthWest Dealer Services",
        "location": "Irvine, California",
        "duration": "Jan 2018 to Mar 2022",
        "description": "Surety Products\nSouthWest Dealer Services (SWDS) is a full-service finance and insurance (F&I) company, training and consulting specialist, and producer of anti-theft hardware, dedicated to the shifting needs of U.S. based auto dealers. With a network of more than..."
      },
      {
        "position": "Senior Accounting Manager",
        "company": "ASICS America Corporation",
        "location": "Irvine, CA",
        "duration": "Jun 2015 to Jan 2018",
        "description": null
      },
      {
        "position": "Senior Accounting Manager",
        "company": "Viant Inc.",
        "location": "",
        "duration": "Feb 2015 to Jun 2015",
        "description": null
      },
      {
        "position": "Assistant Controller",
        "company": "International Education Corporation",
        "location": "",
        "duration": "Aug 2013 to Jan 2015",
        "description": null
      },
      {
        "position": "Assurance Senior",
        "company": "BDO LLP",
        "location": "Reading, United Kingdom",
        "duration": "Nov 2011 to Jun 2013",
        "description": null
      },
      {
        "position": "Senior Accountant - Financial Reporting",
        "company": "Toastmasters International",
        "location": "",
        "duration": "Nov 2010 to Oct 2011",
        "description": null
      },
      {
        "position": "Senior Assurance Associate",
        "company": "BDO USA, LLP",
        "location": "",
        "duration": "Aug 2006 to Nov 2010",
        "description": null
      }
    ]
  },
  {
    "id": "5f0c82cb-2ae0-4a8a-b0ac-98a9b94985e4",
    "name": "Lauren Norvell",
    "linkedin_url": "https://www.linkedin.com/in/laurennorvell",
    "picture_url": null,
    "bio": "CIPP/US\nCIPP/E\nCIPM\nAny testimonial or endorsement on this profile does not constitute a guarantee, warranty, or prediction regarding the outcome of your legal matter. Prior results do not guarantee a similar outcome.\n…see more",
    "role": "Information Governance Attorney",
    "companies": [
      "Latham & Watkins",
      "ALG Intellectual Property, LLC",
      "Lacework",
      "Entrepreneurs' Law Clinic, Santa Clara University School of Law",
      "Pure Storage",
      "San Francisco City Attorney's Office",
      "Picone & Defilippis, A P.L.C.",
      "Apple"
    ],
    "current_location": "San Diego, California, United States",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:35:24.425694",
    "experiences": [
      {
        "position": "Information Governance Attorney",
        "company": "Latham & Watkins",
        "location": "San Diego, California, United States",
        "duration": "Sep 2024 to Present",
        "description": null
      },
      {
        "position": "Attorney",
        "company": "ALG Intellectual Property, LLC",
        "location": "",
        "duration": "Jun 2022 to Jul 2024",
        "description": null
      },
      {
        "position": "Contracts Manager",
        "company": "Lacework",
        "location": "",
        "duration": "Aug 2021 to May 2022",
        "description": null
      },
      {
        "position": "Student Associate",
        "company": "Entrepreneurs' Law Clinic, Santa Clara University School of Law",
        "location": "",
        "duration": "Aug 2020 to Dec 2020",
        "description": null
      },
      {
        "position": "Legal Intern",
        "company": "Pure Storage",
        "location": "",
        "duration": "Feb 2020 to Aug 2020",
        "description": null
      },
      {
        "position": "Legal Intern",
        "company": "San Francisco City Attorney's Office",
        "location": "",
        "duration": "Aug 2019 to Nov 2019",
        "description": null
      },
      {
        "position": "Legal Intern",
        "company": "Picone & Defilippis, A P.L.C.",
        "location": "San Francisco Bay Area",
        "duration": "May 2019 to Aug 2019",
        "description": null
      },
      {
        "position": "GSOC Operations",
        "company": "Apple",
        "location": "Cupertino, Ca",
        "duration": "Mar 2017 to Jul 2018",
        "description": null
      }
    ]
  },
  {
    "id": "1ca67a71-85d1-410a-8a94-d86ab9dc901d",
    "name": "Matthew Chiu",
    "linkedin_url": "https://www.linkedin.com/in/matthewchiu",
    "picture_url": null,
    "bio": "I am passionate about leveraging legal technology tools and project management skills to influence cross-functional teams and deliver optimal outcomes to organization. I have a keen eye to detail like the time I discovered a large service provider using screenshots of our production instance in their training materials!\nWith over 10 years of experience in legal technology and operations, I have a track record of delivering solutions that enhance efficiency, reduce costs, and support growth for diverse practice areas and global teams.\n…see more",
    "role": "Senior Legal Solutions and Technology Analyst",
    "companies": [
      "Electronic Arts (EA)",
      "Cruise",
      "Wilson Sonsini Goodrich & Rosati",
      "Universal Sports Network"
    ],
    "current_location": "Hybrid",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:36:09.553162",
    "experiences": [
      {
        "position": "Senior Legal Solutions and Technology Analyst",
        "company": "Electronic Arts (EA)",
        "location": "",
        "duration": "Oct 2024 to Present",
        "description": "Skills: Project Management\nProject Management"
      },
      {
        "position": "",
        "company": "Cruise",
        "location": "Hybrid",
        "duration": "Full-time - Present",
        "description": "Senior Legal Operations Manager (Senior Program Manager II)\nMar 2023 - Feb 2024 · 1 yr\nSan Francisco Bay Area\n- Negotiated outside counsel rates and conducted RFPs, saving $300K and promoting diversity.\n- Streamlined eDiscovery workflows with Onna.\n- Implemented CLM workflows and advanced reports.\n- Created customizable financial reports with BI tools for user and practice group needs, enabling thorough budget analysis and variance assessments.\n- Negotiated outside counsel rates and conducted RFPs, saving $300K and promoting diversity. - Streamlined eDiscovery workflows with Onna. - Implemented CLM workflows and advanced reports. - Created customizable financial reports with BI tools for user and practice group needs, enabling thorough budget analysis and variance assessments.\nSkills: Business Process Improvement · Budget Management · Management Of Outside Counsel · Legal Technology · Project Management · Strategic Planning · Legal Software · Program Management\nBusiness Process Improvement · Budget Management · Management Of Outside Counsel · Legal Technology · Project Management · Strategic Planning · Legal Software · Program Management\n2023 Legal Department Mansfield Certified (Diversity Lab)\nThe Mansfield Certification is a science-backed and data-driven solution designed to help boost inclusivity, access, and diversity in leadership at law firms and legal departments.\nHow Cruise Moved the Needle to Diversify Its Legal Department (Law.com)\nCruise is a finalist for the Innovation in Diversity and Inclusion Award as part of the California Legal Awards.\nLegal Operations Manager (Legal Program Manager)\nMar 2021 - Mar 2023 · 2 yrs 1 mo\nSan Francisco, California, United States\n- Implemented eBilling system with integrations to Oracle ERP, Salesforce, and IP tools, ensuring accuracy in foreign exchange conversions and tax setups for multiple jurisdictions.\n- Streamlined intellectual property and trademark management processes with integrations with eBilling and DocuSign for efficiency, resulting in an increase in patent filings and reduced times.\n- Coordinated legal support, collaborated on various legal matters across Litigation, Employment, IP, and delivered department-wide training on AV data and visualization systems to enhance team proficiency.\n- Implemented eBilling system with integrations to Oracle ERP, Salesforce, and IP tools, ensuring accuracy in foreign exchange conversions and tax setups for multiple jurisdictions. - Streamlined intellectual property and trademark management processes with integrations with eBilling and DocuSign for efficiency, resulting in an increase in patent filings and reduced times. - Coordinated legal support, collaborated on various legal matters across Litigation, Employment, IP, and delivered department-wide training on AV data and visualization systems to enhance team proficiency.\nSkills: Process Improvement · Business Process Improvement · Attention to Detail · Legal Operations · Legal Billing · Project Management · Program Management · Business Systems Analysis\nProcess Improvement · Business Process Improvement · Attention to Detail · Legal Operations · Legal Billing · Project Management · Program Management · Business Systems Analysis\nHow Cruise Slashed Patent Filing Timelines in Half (Law.com)\nThe IP legal department for self-driving car company Cruise is nominated for the California Legal Awards’ Vanguard Award."
      },
      {
        "position": "",
        "company": "Wilson Sonsini Goodrich & Rosati",
        "location": "On-site",
        "duration": "Full-time - Present",
        "description": "KM & Research Systems Analyst\nJun 2018 - Mar 2021 · 2 yrs 10 mos\nSan Francisco, California, United States\n- Organized and trained on tens of thousands of venture financing agreements using Lexion and iManage RAVN contract analysis and AI tools, extracting over 40 advanced deal terms and clauses with vendor collaboration including a 30 day proof of concept which led to the firm’s first venture investment and subsequent rounds.\n- On-boarded, trained, and managed Asana for 400+ users, developing custom templates for corporate transactions and litigation to enhance collaboration and efficiency.\n- Organized and trained on tens of thousands of venture financing agreements using Lexion and iManage RAVN contract analysis and AI tools, extracting over 40 advanced deal terms and clauses with vendor collaboration including a 30 day proof of concept which led to the firm’s first venture investment and subsequent rounds. - On-boarded, trained, and managed Asana for 400+ users, developing custom templates for corporate transactions and litigation to enhance collaboration and efficiency.\nSkills: Project Management\nProject Management\nWilson Sonsini Joins $4.2m Investment In Lexion AI Contract Analysis Startup\nKnowledge Management Coordinator\nOct 2015 - Jun 2018 · 2 yrs 9 mos\nPalo Alto, California, United States\n- Managed the implementation of document automation tools in collaboration with the KM attorney to produce startup and venture-financing-related documents to enhance access to legal services in a consistent and cost-effective manner such as the publicly available Term Sheet Generator.\nTerm Sheet Generator\nManaged the implementation of document automation tools in collaboration with the KM attorney to produce startup and venture-financing-related documents to enhance access to legal services in a consistent and cost-effective manner such as the publicly available Term Sheet Generator.\nKnowledge Management Assistant\nApr 2013 - Oct 2015 · 2 yrs 7 mos\n- Compiled a range of data on venture financing transactions, SAFE financings and convertible note financings as well as mergers & acquisitions and capital markets in which the firm was involved in to identify relevant trends in activity and valuation levels for U.S. venture capital.\nWSGR Entrepreneurs Report: Private Company Financing Trends\nCompiled a range of data on venture financing transactions, SAFE financings and convertible note financings as well as mergers & acquisitions and capital markets in which the firm was involved in to identify relevant trends in activity and valuation levels for U.S. venture capital."
      },
      {
        "position": "Accounting Intern",
        "company": "Universal Sports Network",
        "location": "Westlake Village, California, United States",
        "duration": "Apr 2012 to Aug 2012",
        "description": null
      }
    ]
  },
  {
    "id": "869a9399-38d9-4a12-aeab-e7656b71ed72",
    "name": "Megan Clark",
    "linkedin_url": "https://www.linkedin.com/in/meganaclark",
    "picture_url": null,
    "bio": "I am a graduate from the University of California, Santa Barbara where I received a Bachelor of Arts in Communication. I have extensive experience in event planning, working in teams, and customer service and I hope to pursue event planning or set design as my career long-term. I currently work at the prop house on the NBCUniversal backlot in the warehouse, where I am right in the middle of the action of television and feature film set dressing. I held the position of Reservations and Events Coordinator at UCSB Campus Conference Services and Vice President of Internal Affairs for my school's chapter of Alpha Kappa Psi, one of the professional coed business fraternities on campus. I have enjoyed planning events and interior design throughout my life for more than a decade. Seeing everything come together after arranging each aspect separately is one of the most rewarding feelings I can think of. For this reason, I am passionate about being a part of a workplace with a clear larger vision.\n…see more",
    "role": null,
    "companies": [
      "NBCUniversal",
      "Eos Lounge",
      "RedEye Presents",
      "Alpha Kappa Psi",
      "UCSB Conference & Hospitality Services"
    ],
    "current_location": "Universal City, CA",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:36:53.413944",
    "experiences": [
      {
        "position": "",
        "company": "NBCUniversal",
        "location": "Universal City, CA",
        "duration": "7 yrs to mos",
        "description": "Property Person, Property Department\nJul 2021 - Present · 4 yrs\n• Help customers locate specific items spanning multiple locations and roughly 750,000 total items\n• Complete order checkout, scan existing barcodes, and create barcodes for items not barcoded\n• Confirm that correct condition of items is maintained during checkin and damage is recorded\n• Handle multiple projects at a time with simultaneous checkins/checkouts, ensure order accuracy\n• Help customers locate specific items spanning multiple locations and roughly 750,000 total items • Complete order checkout, scan existing barcodes, and create barcodes for items not barcoded • Confirm that correct condition of items is maintained during checkin and damage is recorded • Handle multiple projects at a time with simultaneous checkins/checkouts, ensure order accuracy\nBilling Clerk, Property Department\nDec 2017 - Jul 2021 · 3 yrs 8 mos\n• Assist customers with questions and problems that arise on projects\n• Issue order numbers to customers and reconcile billing using RTPro software\n• Research orders and payments as necessary using both Sphere and RTPro technologies\n• Charge customers for rentals and purchases processing purchase orders, cash, or credit cards\n• Answer phone calls and issue drive-on passes to visitors using GateWorks\n• Submit paperwork for approval and file when approval is complete\n• Assist Director, Property Department on various tasks when necessary\n• Assist customers with questions and problems that arise on projects • Issue order numbers to customers and reconcile billing using RTPro software • Research orders and payments as necessary using both Sphere and RTPro technologies • Charge customers for rentals and purchases processing purchase orders, cash, or credit cards • Answer phone calls and issue drive-on passes to visitors using GateWorks • Submit paperwork for approval and file when approval is complete • Assist Director, Property Department on various tasks when necessary"
      },
      {
        "position": "Marketing Intern",
        "company": "Eos Lounge",
        "location": "Santa Barbara, California Area",
        "duration": "Mar 2017 to Jun 2017",
        "description": "• Independently and collaboratively promote upcoming events through targeted social media campaigns on various social media platforms\n• Facilitate greater turnout at shows by organizing transportation and meet-ups for attendees\n• Increase social media reach of the company by generating new, relevant followers\n• Independently and collaboratively promote upcoming events through targeted social media campaigns on various social media platforms • Facilitate greater turnout at shows by organizing transportation and meet-ups for attendees • Increase social media reach of the company by generating new, relevant followers"
      },
      {
        "position": "Music Event Production and Marketing Intern",
        "company": "RedEye Presents",
        "location": "Santa Barbara, California Area",
        "duration": "Mar 2017 to Jun 2017",
        "description": "• Research food/drink vendors, decorations, interactive environments, and activities for a yearly all-ages event in the local area\n• Set up events day of working with venue, artists, and/or outside vendors\n• Find social media content to use in various marketing campaigns\n• Assist in marketing efforts through physical means (posters/flyering) as well as through social media platforms\n• Research food/drink vendors, decorations, interactive environments, and activities for a yearly all-ages event in the local area • Set up events day of working with venue, artists, and/or outside vendors • Find social media content to use in various marketing campaigns • Assist in marketing efforts through physical means (posters/flyering) as well as through social media platforms"
      },
      {
        "position": "",
        "company": "Alpha Kappa Psi",
        "location": "",
        "duration": " - Present",
        "description": "Event Chair\nFeb 2017 - Jun 2017 · 5 mos\nOmicron Omega\n• Supervise committee of 10 members to execute quarterly brotherhood events for the chapter\n• Work with other committees to plan various quarterly and yearly events with a budget of $5000\n• Arrange details of venue, transportation, catering, and decorations for events of up to 100 people\n• Plan largest biyearly event, Initiation Dinner, 4 times with help of only 1-2 other members\n• Supervise committee of 10 members to execute quarterly brotherhood events for the chapter • Work with other committees to plan various quarterly and yearly events with a budget of $5000 • Arrange details of venue, transportation, catering, and decorations for events of up to 100 people • Plan largest biyearly event, Initiation Dinner, 4 times with help of only 1-2 other members\nVice President of Internal Affairs\nMay 2016 - Feb 2017 · 10 mos\n• Led committee of 5 other people to improve overall professionalism of about 20 new members\n• Facilitated weekly workshops for members to improve communication skills and confidence\n• Served on executive board to help make decisions for about 75 people collectively\n• Compiled a 25-page manual detailing position and necessary events for future members\n￼• Awarded “Most Valuable Member” by peers during the time in this position\n• Led committee of 5 other people to improve overall professionalism of about 20 new members • Facilitated weekly workshops for members to improve communication skills and confidence • Served on executive board to help make decisions for about 75 people collectively • Compiled a 25-page manual detailing position and necessary events for future members ￼• Awarded “Most Valuable Member” by peers during the time in this position"
      },
      {
        "position": "Reservations & Events Coordinator",
        "company": "UCSB Conference & Hospitality Services",
        "location": "Santa Barbara, California Area",
        "duration": "May 2014 to Jun 2017",
        "description": "• Serve as a liaison between students, faculty, and outside clients in organizing events\n• Manage up to 10 conferences at a time with varying client and participant needs and expectations\n• Ensure data accuracy by cross-checking detailed information for about 21,000 attendees yearly\n• Prepare billing documents for over 100 conferences using multiple software systems\n• Collaborate with customers to find information they need, direct them to the appropriate person\n• Serve as a liaison between students, faculty, and outside clients in organizing events • Manage up to 10 conferences at a time with varying client and participant needs and expectations • Ensure data accuracy by cross-checking detailed information for about 21,000 attendees yearly • Prepare billing documents for over 100 conferences using multiple software systems • Collaborate with customers to find information they need, direct them to the appropriate person"
      }
    ]
  },
  {
    "id": "b643d670-f7fe-4e95-a534-6689c41d4b41",
    "name": "Patrick White",
    "linkedin_url": "https://www.linkedin.com/in/patrick-white-1183b37",
    "picture_url": null,
    "bio": "Certified Public Accountant specializing in audits of non-public Companies. Experience in a broad range of industries in the San Francisco Bay Area.\nSpecialties: Nonprofit, Manufacturing, Semiconductors, Foundations, High-Tech, Software as a Service\nCertified Public Accountant specializing in audits of non-public Companies. Experience in a broad range of industries in the San Francisco Bay Area. Specialties: Nonprofit, Manufacturing, Semiconductors, Foundations, High-Tech, Software as a Service",
    "role": null,
    "companies": [
      "Frank, Rimerman + Co. LLP",
      "St. Vincent de Paul of Santa Clara County",
      "Pitcher Partners",
      "Bank of America",
      "Franchise Tax Board"
    ],
    "current_location": "San Francisco Bay Area",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:37:36.419864",
    "experiences": [
      {
        "position": "",
        "company": "Frank, Rimerman + Co. LLP",
        "location": "San Francisco Bay Area",
        "duration": "21 yrs to mos",
        "description": "Partner, Assurance and Advisory at Frank, Rimerman + Co. LLP\nJul 2020 - Present · 5 yrs\nDirector, Assurance and Advisory\nSep 2003 - Jul 2020 · 16 yrs 11 mos"
      },
      {
        "position": "Member of the Board of Directors",
        "company": "St. Vincent de Paul of Santa Clara County",
        "location": "Santa Clara County",
        "duration": "Jul 2017 to Present",
        "description": null
      },
      {
        "position": "Secondee - Audit Division",
        "company": "Pitcher Partners",
        "location": "Melbourne, Australia",
        "duration": "Jul 2007 to Oct 2007",
        "description": "Provide audit services for Companies in the the greater Melbourne area including listed and privately held Companies."
      },
      {
        "position": "Teller/Customer Service Representative",
        "company": "Bank of America",
        "location": "Santa Barbara, California Area",
        "duration": "Jul 2000 to Jul 2003",
        "description": "A Tellers' primary responsibility is to process transactions accurately and efficiently in accordance with established policies and procedures. Identify customer needs and refer financial products and services to consumer and small business customers. Act as Bank of Americas face to the customer and consistently seek to delight our customers by demonstrating The Bank of America Spirit. Ensure regulatory requirements, such as Anti-Money Laundering and Bank Secrecy Act are adhered to."
      },
      {
        "position": "Student Assistant",
        "company": "Franchise Tax Board",
        "location": "Sacramento, California",
        "duration": "Jan 2000 to Jun 2000",
        "description": "Analyzed and corrected taxpayer return information."
      }
    ]
  },
  {
    "id": "7b73bf5b-227a-40eb-add2-6eb653ec3782",
    "name": "Meeka Wu",
    "linkedin_url": "https://www.linkedin.com/in/meekawu",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [
      "Palantir Technologies",
      "PAX Labs, Inc.",
      "Palantir Technologies",
      "Virgin America",
      "Bare Escentuals",
      "Ernst & Young LLP"
    ],
    "current_location": "San Francisco Bay Area",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:38:20.599206",
    "experiences": [
      {
        "position": "",
        "company": "Palantir Technologies",
        "location": "",
        "duration": " - Present",
        "description": "Controller\nDec 2024 - Present · 7 mos\nAssistant Controller\nJan 2024 - Nov 2024 · 11 mos\nHead of International Accounting\nMar 2023 - Dec 2023 · 10 mos\nSenior Corporate Accounting Manager\nSep 2020 - Feb 2023 · 2 yrs 6 mos"
      },
      {
        "position": "Controller / Head of Accounting",
        "company": "PAX Labs, Inc.",
        "location": "San Francisco Bay Area",
        "duration": "Jan 2019 to Sep 2020",
        "description": null
      },
      {
        "position": "International Accounting Manager",
        "company": "Palantir Technologies",
        "location": "",
        "duration": "Sep 2011 to Mar 2018",
        "description": null
      },
      {
        "position": "Senior Corporate Accountant",
        "company": "Virgin America",
        "location": "",
        "duration": "Jun 2008 to Jul 2011",
        "description": null
      },
      {
        "position": "Inventory Accountant",
        "company": "Bare Escentuals",
        "location": "",
        "duration": "Dec 2005 to Jun 2008",
        "description": null
      },
      {
        "position": "Auditor",
        "company": "Ernst & Young LLP",
        "location": "",
        "duration": "Oct 2002 to Dec 2004",
        "description": null
      }
    ]
  },
  {
    "id": "2295689d-c26e-4953-b1ba-cbfb3ae305fa",
    "name": "Quan Le",
    "linkedin_url": "https://www.linkedin.com/in/quanle03",
    "picture_url": null,
    "bio": "My education and professional experience are focused on strategy & operations, business analytics, and policy communications",
    "role": null,
    "companies": [
      "DoorDash",
      "Wish",
      "Foreign and Commonwealth Office",
      "Davies"
    ],
    "current_location": "Greater Los Angeles Area",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:39:02.955378",
    "experiences": [
      {
        "position": "",
        "company": "DoorDash",
        "location": "",
        "duration": " - Present",
        "description": "Associate, Product Strategy & Operations\nJun 2023 - Mar 2025 · 1 yr 10 mos\nproduct operations, fulfillment & delivery\nBusiness Analyst, New Verticals\nApr 2022 - Jun 2023 · 1 yr 3 mos\nstrategy & operations, grocery\nSkills: Data Analytics · SQL · Go-to-Market Strategy · A/B Testing · Sigma Business Analytics Software · Exploratory Research\nData Analytics · SQL · Go-to-Market Strategy · A/B Testing · Sigma Business Analytics Software · Exploratory Research"
      },
      {
        "position": "Business Operations Associate",
        "company": "Wish",
        "location": "",
        "duration": "Aug 2021 to Apr 2022",
        "description": "optimized the expansion of Wish Local pick-up points in North America\nSkills: Project Planning · Customer Relationship Management (CRM) · Business Process Efficiency · Data Analysis\nProject Planning · Customer Relationship Management (CRM) · Business Process Efficiency · Data Analysis"
      },
      {
        "position": "Policy Analyst Intern",
        "company": "Foreign and Commonwealth Office",
        "location": "Greater Los Angeles Area",
        "duration": "2020 - - Present",
        "description": "promoted the UK as an investment partner in the green energy and defense sector.\nreported to the Senior Trade Policy Advisor\npromoted the UK as an investment partner in the green energy and defense sector. reported to the Senior Trade Policy Advisor"
      },
      {
        "position": "Public Affairs Intern",
        "company": "Davies",
        "location": "Santa Barbara, California Area",
        "duration": "2019 - - Present",
        "description": "mining, real estate, and green energy"
      }
    ]
  },
  {
    "id": "ef7dfe73-ffc8-4fde-87bb-4f56c028b8a4",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/nathaniel-uy-682320",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:39:22.809581",
    "experiences": []
  },
  {
    "id": "061fbdaf-8308-4e21-90ad-040c49e35833",
    "name": "Nicole Magaddino (Simonian), CPA",
    "linkedin_url": "https://www.linkedin.com/in/nicole-magaddino-simonian-cpa-16b9b3",
    "picture_url": null,
    "bio": "Is your Finance/Accounting infrastructure growing and you have limited time to devote to hiring? Are you prepared to attract the right Finance/Accounting professionals against others who are hiring in your market who may already have a robust hiring process?\nThe Bay Area hiring landscape is a competitive one. When you find yourself looking to hire ideally it is because you are being proactive in assessing your growth and infrastructure; however, many times it is often “I needed someone to start yesterday”. There is an absolute appreciation of having a strong due diligence process, but it will be imperative for this process to be effective and efficient.\nA strong recruiting partner who (i) understands the marketplace (ii) is experienced in maneuvering through this complex landscape, (iii) is strategic and nimble, (iv) has a strong network of professionals, and (v) who has been in your shoes is imperative.\nWhat led me into this field? At the point of receiving my CPA and rounding out nearly 5 years of public accounting I reflected on what I enjoyed most. It was a quick and clear answer - client services, relationship building, and understanding the needs of a business. I then turned to a recruiter to assist in my next career move. I spoke with a variety of recruiters and those who positively stood out were not necessarily the ones who placed me, but the ones who listened to my desires and needs.\nThus, the joy of being strategic with my clients coupled with curiosity on how to stand out in this market...I ventured into this field. 17 years later I enjoy it more today than ever and being known as a market leader is the icing.\nI have won awards throughout my career, such as a Chairman’s award ranking me #7 in the world, but the reward of a successful search continues to drive me today.\nPropel Recruitment is a boutique firm specializing in Finance/Accounting recruitment and staffing (both temp and perm).\nLet’s connect on how we can bring value to this partnership! Call me today at (650) 291-0430 or email me at nicole.magaddino@propelrecruitment.com\nLook forward to hearing from you.\n…see more",
    "role": "Founder, Director of Recruiting and Client Services",
    "companies": [
      "Propel Recruitment LLC",
      "Episcopal Day School of St. Matthew",
      "Robert Half Finance & Accounting",
      "KPMG"
    ],
    "current_location": "San Francisco Bay Area",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:40:00.899024",
    "experiences": [
      {
        "position": "Founder, Director of Recruiting and Client Services",
        "company": "Propel Recruitment LLC",
        "location": "San Francisco Bay Area",
        "duration": "Jul 2017 to Present",
        "description": "At Propel Recruitment we specialize in partnering with clients and professionals in the field of Accounting/Finance/Administrative, on a direct hire basis.\nWe partner with professionals to understand their career goals and help guide them through the recruitment process to find the right employment match. We advise professionals on market trends and ensure that their long-term career goals are met. Our goal is to assist in any way that we can to help Propel Your Career.\nWe take note to completely understand the client’s short term and long term organizational goals and assist in ensuring that their Accounting & Finance functions are staffed with the professionals who will see that these goals are met. At Propel Recruitment, we strive to be a business partner that will help you Elevate Your Business.\nLet us help you Propel Your Career, Elevate Your Business\nAt Propel Recruitment we specialize in partnering with clients and professionals in the field of Accounting/Finance/Administrative, on a direct hire basis. We partner with professionals to understand their career goals and help guide them through the recruitment process to find the right employment match. We advise professionals on market trends and ensure that their long-term career goals are met. Our goal is to assist in any way that we can to help Propel Your Career. We take note to completely understand the client’s short term and long term organizational goals and assist in ensuring that their Accounting & Finance functions are staffed with the professionals who will see that these goals are met. At Propel Recruitment, we strive to be a business partner that will help you Elevate Your Business. Let us help you Propel Your Career, Elevate Your Business"
      },
      {
        "position": "Chair of The Board of Trustees",
        "company": "Episcopal Day School of St. Matthew",
        "location": "San Francisco Bay Area",
        "duration": "Jul 2020 to Jun 2024",
        "description": null
      },
      {
        "position": "Vice President, Director of Permanent Placement Services",
        "company": "Robert Half Finance & Accounting",
        "location": "San Francisco Bay Area",
        "duration": "Nov 2004 to Mar 2017",
        "description": "• Plan, develop and implement recruitment strategies to ensure successful placements.\n• Maintain the highest degree of standards and ethics.\n• Thoroughly, understand the needs of the clients and professionals.\n• Consult with clients to ensure that our placement process is efficient and cost-effective.\n• Direct the Finance/Accounting and OfficeTeam permanent placement teams on the Peninsula\n• Plan, develop and implement recruitment strategies to ensure successful placements. • Maintain the highest degree of standards and ethics. • Thoroughly, understand the needs of the clients and professionals. • Consult with clients to ensure that our placement process is efficient and cost-effective. • Direct the Finance/Accounting and OfficeTeam permanent placement teams on the Peninsula"
      },
      {
        "position": "Supervising Senior Auditor",
        "company": "KPMG",
        "location": "San Francisco",
        "duration": "1999 - - Present",
        "description": "• Perform and document substantive tests for financial accounts including identifying, sourcing, and prioritizing clients’ key risks, and comparative financial statement ratio and trend analysis\n• Assist clients with quarterly and annual SEC filings, including 10Q’s and 10K’s\n• Maintain and foster positive client relationships at all levels of client management\n• Primary reviewer for all work completed on engagements\n• Research GAAP and SEC literature for engagement teams and clients\n• National Audit Instructor\n• Regularly participate in college recruiting process\n• Perform and document substantive tests for financial accounts including identifying, sourcing, and prioritizing clients’ key risks, and comparative financial statement ratio and trend analysis • Assist clients with quarterly and annual SEC filings, including 10Q’s and 10K’s • Maintain and foster positive client relationships at all levels of client management • Primary reviewer for all work completed on engagements • Research GAAP and SEC literature for engagement teams and clients • National Audit Instructor • Regularly participate in college recruiting process"
      }
    ]
  },
  {
    "id": "f420048a-5053-45e3-b9e5-5cdb696fe241",
    "name": "Niketa Shah Mehta",
    "linkedin_url": "https://www.linkedin.com/in/niketa",
    "picture_url": null,
    "bio": "Harris Spice, SONY International Projects: SPTI India - SET India, SPRI Benelux, SPHE Japan, Russia TV projects\nInternational business experience at business process evaluation and internal controls.\nSpecialties: Business process reviews for efficiency and internal controls, GAAP Accounting, Financial Analysis, Budgets, Month-Qtr-Year end review, ERP Discovery and Implementation\n…see more",
    "role": "Harris Spice Company",
    "companies": [
      "11 yrs 1 mo",
      "Sony Pictures Entertainment",
      "Sony Corporation of America",
      "Harris Freeman Group Companies",
      "RM Asia Group of Companies",
      "Grant Thornton LLP",
      "PwC",
      "Securities & Exchange Commission"
    ],
    "current_location": "Culver City",
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:40:45.556825",
    "experiences": [
      {
        "position": "Harris Spice Company",
        "company": "11 yrs 1 mo",
        "location": "",
        "duration": "Anaheim, California, to States",
        "description": "Consultant - Finance Director\nPart-time\nJan 2023 - Present · 2 yrs 6 mos\nSenior Finance Manager\nContract\nJun 2014 - Present · 11 yrs 1 mo\nAssist in acquisitions, due diligence, Financial overview, budgets, actuals, year end, qtrly review. Board reports, Ah-hoc Board of Directors analysis and presentations. IFS ERP discovery, implementation."
      },
      {
        "position": "Business Manager",
        "company": "Sony Pictures Entertainment",
        "location": "Culver City",
        "duration": "Mar 2008 to Dec 2014",
        "description": "Oversee and manage TV Network channels (SET, AXN, ANIMAX, BEYOND, SETONE, TV1 and MYSTERY) in Asia, Japan, and Australia.\n• US owner of all Asia TV networks finance related matters, including coordination, review and analysis of monthly actual, budget, forecast, rebills and production of the monthly HO actual report\n• Analyze actual, budget and forecast information submitted by 10 Asia TV channels, provide guidance to the channels if needed, and prepare SPE templates for consolidation reporting\n• Prepare management reporting for SVP and President on long range plans, budgets, forecasts, and actuals. Gain buy in of Senior Management and necessary approvals for Territory long term programming purchases, capital expenditures, and various greenlight projects.\n• Present Territory projects, financials, budgets, forecasts, and analysis to Vice President and Director on a regular basis.\n• Perform monthly close process and corresponding analysis to ensure that all financial information is recorded accurately and aligned with SPE policies and the U.S. GAAP\n• Collaborate with the territory finance directors and accounting groups for audits, preparing and providing all information needed such as monthly financial templates, corporate forms, audit reports/analysis, etc\n• Analyze data and results for possible reporting errors in channel financial and SAP, prepare ad-hoc analysis on a timely basis to ensure Asia financials and movements are recorded accurately;\nOversee and manage TV Network channels (SET, AXN, ANIMAX, BEYOND, SETONE, TV1 and MYSTERY) in Asia, Japan, and Australia. • US owner of all Asia TV networks finance related matters, including coordination, review and analysis of monthly actual, budget, forecast, rebills and production of the monthly HO actual report • Analyze actual, budget and forecast information submitted by 10 Asia TV channels, provide guidance to the channels if needed, and prepare SPE templates for consolidation reporting • Prepare management reporting for SVP and President on long range plans, budgets, forecasts, and actuals. Gain buy in of Senior Management and necessary approvals for Territory long term programming purchases, capital expenditures, and various greenlight projects. • Present Territory projects, financials, budgets, forecasts, and analysis to Vice President and Director on a regular basis. • Perform monthly close process and corresponding analysis to ensure that all financial information is recorded accurately and aligned with SPE policies and the U.S. GAAP • Collaborate with the territory finance directors and accounting groups for audits, preparing and providing all information needed such as monthly financial templates, corporate forms, audit reports/analysis, etc • Analyze data and results for possible reporting errors in channel financial and SAP, prepare ad-hoc analysis on a timely basis to ensure Asia financials and movements are recorded accurately;"
      },
      {
        "position": "Senior Auditor - Project Lead",
        "company": "Sony Corporation of America",
        "location": "Greater Los Angeles Area",
        "duration": "Feb 2008 to Nov 2011",
        "description": "Project Lead performing detailed project scope, task resource allocation to develop fieldwork roadmap while managing closing of multiple projects for over 20 internal audits across SONY groups across 8 countries.\nConducted and led audit closing meetings to territory and home office management presenting financial and operational results, gaining buy-in of key stakeholders to develop solutions for process improvement.\nPresenter of 4 department wide presentations to an audience of up to 60 auditors, and conducted a full day department meeting including speaker line up.\nToastmasters member at SONY delivering 4+ speeches and winner of table topics competition.\nProject Lead performing detailed project scope, task resource allocation to develop fieldwork roadmap while managing closing of multiple projects for over 20 internal audits across SONY groups across 8 countries. Conducted and led audit closing meetings to territory and home office management presenting financial and operational results, gaining buy-in of key stakeholders to develop solutions for process improvement. Presenter of 4 department wide presentations to an audience of up to 60 auditors, and conducted a full day department meeting including speaker line up. Toastmasters member at SONY delivering 4+ speeches and winner of table topics competition."
      },
      {
        "position": "Finance Manager",
        "company": "Harris Freeman Group Companies",
        "location": "",
        "duration": "Dec 2006 to Feb 2008",
        "description": "Managed strategic negotiations with 5+ insurance, storage, and supply vendors to achieve competitive advantage as commodity traders and promote $50M+ in black pepper futures contracts from Indonesia, Vietnam, and Brazil.\nDrive implementation team through a structured approach for legacy systems upgrade to MAS 500 and iTrade. Advise on optimal set-up and functionality of PO, SO, and Inventory processes. Results used to streamline long/short positions reporting, and reduce overhead by 20%.\nManaged financial close process with back office shared service team of 10 employees; Conducted variance analysis on monthly financials. Prepare and monitor budget, cost reporting, and forecast in order to manage pricing decisions to reach goal of 10% profit margin increase.\nImplemented business process changes for post-acquisition operations integration; delivered savings of $100K in overheads. Prepared 3 due diligence reports for potential acquisition targets, led to $2M in asset purchases.\nManaged strategic negotiations with 5+ insurance, storage, and supply vendors to achieve competitive advantage as commodity traders and promote $50M+ in black pepper futures contracts from Indonesia, Vietnam, and Brazil. Drive implementation team through a structured approach for legacy systems upgrade to MAS 500 and iTrade. Advise on optimal set-up and functionality of PO, SO, and Inventory processes. Results used to streamline long/short positions reporting, and reduce overhead by 20%. Managed financial close process with back office shared service team of 10 employees; Conducted variance analysis on monthly financials. Prepare and monitor budget, cost reporting, and forecast in order to manage pricing decisions to reach goal of 10% profit margin increase. Implemented business process changes for post-acquisition operations integration; delivered savings of $100K in overheads. Prepared 3 due diligence reports for potential acquisition targets, led to $2M in asset purchases."
      },
      {
        "position": "Business Development Consultant",
        "company": "RM Asia Group of Companies",
        "location": "",
        "duration": "Jan 2006 to Feb 2006",
        "description": "Created and delivered a business feasibility study to the Board of Directors, which featured a risk analysis matrix, a detailed pricing model, and potential growth opportunities for capital lease financing in the country of Cambodia to service $64M in ongoing World Bank funded construction projects."
      },
      {
        "position": "Senior Associate",
        "company": "Grant Thornton LLP",
        "location": "",
        "duration": "Feb 2005 to Sep 2005",
        "description": "Preformed and wrote five buy-side financial due diligence reports for private equity and strategic buyers for deals ranging in size from $500K to $200M; resulted in 80% successful acquisitions.\nValued post-acquisition business operations that led to purchase price adjustments of 2X EBITDA, and cost savings of $300K in overheads.\nPreformed and wrote five buy-side financial due diligence reports for private equity and strategic buyers for deals ranging in size from $500K to $200M; resulted in 80% successful acquisitions. Valued post-acquisition business operations that led to purchase price adjustments of 2X EBITDA, and cost savings of $300K in overheads."
      },
      {
        "position": "Experienced Associate",
        "company": "PwC",
        "location": "",
        "duration": "2002 - - Present",
        "description": "Managed projects with up to 4 associates performing audits, internal controls testing, reviews and AUP engagements;\nClients included: Disney Corp., Farmers Insurance, Wella AG, OPI Products, Roll Corp., Semines Seeds, Patagonia\nReviewed substantive testing, reported and advised on audit and accounting issues to clients and upper management; resulted in the proper issuance of over 40 financial statement reports.\nIdentified, researched, and resolved technical auditing and accounting issues such as revenue recognition (SAB 101/104), recall accruals, business combinations (FAS 141), and inventory reserves.\nManaged projects with up to 4 associates performing audits, internal controls testing, reviews and AUP engagements; Clients included: Disney Corp., Farmers Insurance, Wella AG, OPI Products, Roll Corp., Semines Seeds, Patagonia Reviewed substantive testing, reported and advised on audit and accounting issues to clients and upper management; resulted in the proper issuance of over 40 financial statement reports. Identified, researched, and resolved technical auditing and accounting issues such as revenue recognition (SAB 101/104), recall accruals, business combinations (FAS 141), and inventory reserves."
      },
      {
        "position": "Intern Associate",
        "company": "Securities & Exchange Commission",
        "location": "",
        "duration": "Mar 2002 to Jun 2002",
        "description": "Office of Investor Education and Assistance\nResearched answers to specific investor questions for the national \"Investor Summit\"\nReplied to over 400 investor complaints, topics included renamed stocks, Enron, the Nigerian Investor Fraud Scam\nOffice of Investor Education and Assistance Researched answers to specific investor questions for the national \"Investor Summit\" Replied to over 400 investor complaints, topics included renamed stocks, Enron, the Nigerian Investor Fraud Scam"
      }
    ]
  },
  {
    "id": "8aeccfd3-3231-4fc1-a823-07d02a2c8d8c",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/aaron-cohen-b838281",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:41:05.904720",
    "experiences": []
  },
  {
    "id": "d46e20b8-aa93-49f4-99d6-8adfdf9f2f9e",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/adela-amador-2a95b213",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:42:08.164494",
    "experiences": []
  },
  {
    "id": "ac29da7c-2dde-42d3-a10d-bb370aca74a4",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/katherinewang",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:42:55.023473",
    "experiences": []
  },
  {
    "id": "6cda424d-e867-4c16-af39-8251911a5abc",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/joelwynton",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:43:19.735495",
    "experiences": []
  },
  {
    "id": "4fd1b67b-0a4b-49db-87ba-631e5d1da85d",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/amar-bell-80aa953",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:43:53.208972",
    "experiences": []
  },
  {
    "id": "596afea9-bfbf-4b6b-8300-8c51a9eff639",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/amy-danos-348a8331",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:44:16.773723",
    "experiences": []
  },
  {
    "id": "5bbca55b-1a79-4c73-848c-a84d114ca3ff",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/amy-danos-b8398796",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:44:50.374773",
    "experiences": []
  },
  {
    "id": "8b16a06d-4a74-467f-b8d4-8c7470d9bf78",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/andrew-jost-cfa-2548b120",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:45:36.522044",
    "experiences": []
  },
  {
    "id": "d16734af-0aa3-486c-bf43-db44a01efd4a",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/noeldelatorre",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:45:59.538197",
    "experiences": []
  },
  {
    "id": "c188aa8b-9212-4575-aeec-3e1518496cb5",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/pratik-gadamasetti-cpa-70078936",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:46:23.268290",
    "experiences": []
  },
  {
    "id": "8dddc4cb-efc6-44ca-be77-9ae3222233e1",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/openmindpd",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:46:57.154243",
    "experiences": []
  },
  {
    "id": "c599d8cd-8dc6-4a14-9515-f6c6c238e5ac",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/patrick-white-1183b37",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:47:32.306617",
    "experiences": []
  },
  {
    "id": "ac35d667-b904-4f59-9983-af7f306f5b88",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/peter-bhusiririt-4969644",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:48:17.232220",
    "experiences": []
  },
  {
    "id": "09d2651b-e7e5-45ec-8b90-89b182f35fbc",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/priyashaagarwal",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:48:42.812829",
    "experiences": []
  },
  {
    "id": "cbe2fe1a-13c8-4689-916b-e4266a7cccb5",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/profile/view",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:49:29.685399",
    "experiences": []
  },
  {
    "id": "b8edcf91-b8b5-45bf-a92d-d9fc073c6fce",
    "name": null,
    "linkedin_url": "http://linkedin.com/in/rachelsng",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:50:04.737950",
    "experiences": []
  },
  {
    "id": "87d4f648-e328-4f21-8ba3-083601f897a0",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/quincy-oswald-96556163",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:50:27.116048",
    "experiences": []
  },
  {
    "id": "319ae938-614c-4433-9a8b-604d6e0d3677",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/rgupta0",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:50:51.158038",
    "experiences": []
  },
  {
    "id": "b1cbf657-49f5-4843-842e-2d38d4f8a9cf",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/randylee0516",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:51:24.006313",
    "experiences": []
  },
  {
    "id": "2c9d30fb-cccd-4afe-bd9f-f8c93b6fa44b",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/andrea-rhea-festejo-1128a322",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:51:57.691477",
    "experiences": []
  },
  {
    "id": "326bab0e-c861-47e6-beb9-599874ef0d63",
    "name": null,
    "linkedin_url": "http://linkedin.com/in/rick-nanda-279757",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:52:33.648948",
    "experiences": []
  },
  {
    "id": "4ddebf0a-b678-41cc-bda3-450f24479728",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/ralph-rivera-a3442165",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:53:19.514627",
    "experiences": []
  },
  {
    "id": "8015136d-fc62-448c-8904-0ffec702e97b",
    "name": null,
    "linkedin_url": "http://www.linkedin.com/in/robinbrozosky",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:54:06.444791",
    "experiences": []
  },
  {
    "id": "cf526902-ac64-49bf-951f-8572842dbf89",
    "name": null,
    "linkedin_url": "http://www.linkedin.com/in/roxannebrecek",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:54:50.471652",
    "experiences": []
  },
  {
    "id": "50c42cc8-9b17-48d7-aa7e-a90906d1dc48",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/rhironaka",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:55:12.897236",
    "experiences": []
  },
  {
    "id": "0532d445-a9fe-4582-9910-c83210661a2c",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/luoryan",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:55:47.045905",
    "experiences": []
  },
  {
    "id": "e0d910a5-f722-4638-8a40-3419983e6eab",
    "name": null,
    "linkedin_url": "http://www.linkedin.com/profile/view",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:56:21.992983",
    "experiences": []
  },
  {
    "id": "aea504f9-4ab5-460e-a9fc-4ba27d197cca",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/scott-cohen-5909579",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:57:06.459300",
    "experiences": []
  },
  {
    "id": "1c8b8af9-e7f1-46c1-ae92-b0cca811434e",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/scott-fulkerson-cpa-27453",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:57:28.799442",
    "experiences": []
  },
  {
    "id": "95da8cfc-48cf-47ba-adf6-2e1155e77f22",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/shelby-cleland",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:58:04.022189",
    "experiences": []
  },
  {
    "id": "0f38d537-d3f1-4c28-ad97-5d09b6718b8b",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/shikhasharma4",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:58:40.065957",
    "experiences": []
  },
  {
    "id": "d6749cb7-fdc4-4f5d-ac65-c95998c28c98",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/shu-chen-2463861a",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T14:59:25.249654",
    "experiences": []
  },
  {
    "id": "2ad39e12-8218-447e-b125-5eaf9bd09eab",
    "name": null,
    "linkedin_url": "http://linkedin.com/in/shyamkhakhria",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:00:00.245588",
    "experiences": []
  },
  {
    "id": "4161a9ef-3b2d-4837-9ac8-7cb43fc7bb00",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/simonchuang",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:00:24.240206",
    "experiences": []
  },
  {
    "id": "2e2c27ee-e581-47c2-8b85-4ec4e6a13a81",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/sonia-corsi-788b9313",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:00:48.765850",
    "experiences": []
  },
  {
    "id": "022c025f-5d66-4b46-984f-693a591c50d7",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/stephanietsuyemura",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:01:34.845361",
    "experiences": []
  },
  {
    "id": "0833881f-c1e3-4bb9-adb8-0eb5b9fec124",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/benjamincwalters",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:02:09.507815",
    "experiences": []
  },
  {
    "id": "d013ecde-34cb-4303-bd57-08220aba47f3",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/tdpae",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:02:33.072933",
    "experiences": []
  },
  {
    "id": "85b975c9-8ede-4a4d-9672-30304f38a8e2",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/thien-tran-9339923b",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:03:18.777534",
    "experiences": []
  },
  {
    "id": "049b964e-245f-4992-8339-7b4bf8e45b49",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/tianaly",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:04:05.102115",
    "experiences": []
  },
  {
    "id": "4c1e35d8-e375-4d1f-9942-e8306278a039",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/tiffanyschandra",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:04:38.894058",
    "experiences": []
  },
  {
    "id": "272bef73-fc98-469d-98fc-eef727ea2390",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/tiffanychiayiwu",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:05:13.853829",
    "experiences": []
  },
  {
    "id": "10bbb7e0-9dba-47c8-8b13-309fecd0f6fe",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/timxie",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:05:38.700584",
    "experiences": []
  },
  {
    "id": "30941d9a-d85b-4908-9637-1d1e2355c19e",
    "name": null,
    "linkedin_url": "http://www.linkedin.com/profile/view",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:06:13.603601",
    "experiences": []
  },
  {
    "id": "956364cc-688f-4a56-ae98-8e8bbda14ed7",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/tyler-willis-cpa-2754855",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:06:36.956778",
    "experiences": []
  },
  {
    "id": "eaf85e4f-881a-48e2-b1a9-62dde05f5982",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/vania-chen-51b0847",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:07:11.449001",
    "experiences": []
  },
  {
    "id": "0d104fbc-4dd5-4980-81e2-e383713183b8",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/victor-bui-1785134a",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:07:34.615501",
    "experiences": []
  },
  {
    "id": "ee753a8e-c9b3-4570-be46-930872fc317f",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/viviansam13",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:08:19.123493",
    "experiences": []
  },
  {
    "id": "cfd80136-f910-424b-8318-949d9311bf52",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/wan-see-cheung-b7a7a818",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:08:42.554842",
    "experiences": []
  },
  {
    "id": "7e824a8d-3f56-4b18-bfec-ac3fc106b7c4",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/wayne-feng-732a398",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:09:08.098680",
    "experiences": []
  },
  {
    "id": "3f166524-3346-4d4c-998b-f262b5ed2e22",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/tylergwillis",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:09:41.136213",
    "experiences": []
  },
  {
    "id": "cbfb4bd4-90ba-4967-8697-f894a25b3e86",
    "name": null,
    "linkedin_url": "https://www.linkedin.com/in/yani-andrianos-6492034",
    "picture_url": null,
    "bio": null,
    "role": null,
    "companies": [],
    "current_location": null,
    "has_linkedin": true,
    "scraped": true,
    "manually_verified": false,
    "created_at": "2025-06-18T15:10:28.686887",
    "experiences": []
  }
]